{"keras_version": "2.1.1", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "batch_input_shape": [null, 32, 32, 1], "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_9", "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_10"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_17"}}, {"class_name": "Conv2D", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_11"}}, {"class_name": "Conv2D", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_12"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_18"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 2256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "name": "dense_15", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_16", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.6, "seed": null, "noise_shape": null, "name": "dropout_19"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 1256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "name": "dense_16", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_17", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_20"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 756, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "name": "dense_17", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_18", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_21"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 556, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "name": "dense_18", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_19", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_22"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "name": "dense_19", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_20", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "seed": null, "noise_shape": null, "name": "dropout_23"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 156, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "name": "dense_20", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_21", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "seed": null, "noise_shape": null, "name": "dropout_24"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 14, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "softmax", "name": "dense_21", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}]}